Hakob23/thermal-monitoring/hardware-emulation/stm32-sensors/STM32_SensorNode.cpp
#include "STM32_SensorNode.h"
#include <iostream>
#include <sstream>
#include <iomanip>
#include <cmath>
#include <algorithm>
#include <fstream>

namespace stm32_simulation {

//=============================================================================
// STM32_SensorNode Implementation
//=============================================================================

STM32_SensorNode::STM32_SensorNode(const SensorNodeConfig& config)
    : config_(config), running_(false), initialized_(false),
      random_generator_(std::random_device{}()),
      temp_noise_(0.0f, config.noise_level),
      humidity_noise_(0.0f, config.noise_level * 2.0f),
      fault_dist_(0.0f, 1.0f),
      current_base_temp_(config.base_temperature),
      current_base_humidity_(config.base_humidity),
      temp_trend_(0.0f), humidity_trend_(0.0f),
      sensor_fault_(false), connection_fault_(false),
      sensor_drift_(0.0f), supply_voltage_(3.3f),
      reading_count_(0), transmission_count_(0) {
    
    reading_history_.reserve(MAX_HISTORY);
    start_time_ = std::chrono::steady_clock::now();
    
    std::cout << "🔧 [" << config_.node_id << "] STM32 " << get_sensor_type_string() 
              << " sensor node created at " << config_.location << std::endl;
}

STM32_SensorNode::~STM32_SensorNode() {
    stop();
    std::cout << "🏁 [" << config_.node_id << "] STM32 sensor node destroyed" << std::endl;
}

bool STM32_SensorNode::initialize() {
    if (initialized_.load()) {
        return true;
    }
    
    std::cout << "🚀 [" << config_.node_id << "] Initializing STM32 sensor node..." << std::endl;
    std::cout << "   Sensor Type: " << get_sensor_type_string() << std::endl;
    std::cout << "   Communication: " << get_comm_protocol_string() << std::endl;
    std::cout << "   Environment: " << get_environment_pattern_string() << std::endl;
    std::cout << "   Reading Interval: " << config_.reading_interval_ms << "ms" << std::endl;
    std::cout << "   Transmission Interval: " << config_.transmission_interval_ms << "ms" << std::endl;
    
    // Simulate hardware initialization
    supply_voltage_ = simulate_supply_voltage();
    sensor_drift_ = 0.0f;
    
    // Reset counters
    reading_count_ = 0;
    transmission_count_ = 0;
    
    initialized_ = true;
    std::cout << "✅ [" << config_.node_id << "] STM32 sensor node initialized" << std::endl;
    return true;
}

bool STM32_SensorNode::start() {
    if (!initialized_.load()) {
        std::cerr << "❌ [" << config_.node_id << "] Cannot start: node not initialized" << std::endl;
        return false;
    }
    
    if (running_.load()) {
        std::cout << "⚠️ [" << config_.node_id << "] Node already running" << std::endl;
        return true;
    }
    
    running_ = true;
    
    // Start sensor reading thread
    sensor_thread_ = std::thread(&STM32_SensorNode::sensor_reading_loop, this);
    
    // Start transmission thread
    transmission_thread_ = std::thread(&STM32_SensorNode::transmission_loop, this);
    
    std::cout << "🚀 [" << config_.node_id << "] STM32 sensor node started" << std::endl;
    return true;
}

void STM32_SensorNode::stop() {
    if (!running_.load()) {
        return;
    }
    
    std::cout << "🛑 [" << config_.node_id << "] Stopping STM32 sensor node..." << std::endl;
    running_ = false;
    
    // Wait for threads to finish
    if (sensor_thread_.joinable()) {
        sensor_thread_.join();
    }
    if (transmission_thread_.joinable()) {
        transmission_thread_.join();
    }
    
    std::cout << "✅ [" << config_.node_id << "] STM32 sensor node stopped gracefully" << std::endl;
}

std::string STM32_SensorNode::get_status() const {
    std::stringstream ss;
    ss << "[" << config_.node_id << "] ";
    ss << (running_.load() ? "RUNNING" : "STOPPED");
    ss << " | Readings: " << reading_count_;
    ss << " | Transmissions: " << transmission_count_;
    ss << " | Supply: " << std::fixed << std::setprecision(2) << supply_voltage_ << "V";
    
    if (sensor_fault_) ss << " | SENSOR_FAULT";
    if (connection_fault_) ss << " | CONN_FAULT";
    
    return ss.str();
}

SensorReading STM32_SensorNode::get_last_reading() const {
    std::lock_guard<std::mutex> lock(data_mutex_);
    return last_reading_;
}

std::vector<SensorReading> STM32_SensorNode::get_reading_history(int count) const {
    std::lock_guard<std::mutex> lock(data_mutex_);
    
    std::vector<SensorReading> result;
    int start_index = std::max(0, static_cast<int>(reading_history_.size()) - count);
    
    for (int i = start_index; i < static_cast<int>(reading_history_.size()); ++i) {
        result.push_back(reading_history_[i]);
    }
    
    return result;
}

void STM32_SensorNode::set_uart_callback(std::function<void(const std::string&, const std::vector<uint8_t>&)> callback) {
    uart_callback_ = callback;
}

void STM32_SensorNode::set_mqtt_callback(std::function<void(const std::string&, const std::string&)> callback) {
    mqtt_callback_ = callback;
}

void STM32_SensorNode::inject_fault() {
    sensor_fault_ = true;
    std::cout << "🚨 [" << config_.node_id << "] Fault injected" << std::endl;
}

void STM32_SensorNode::simulate_power_loss(int duration_ms) {
    std::cout << "⚡ [" << config_.node_id << "] Simulating power loss for " << duration_ms << "ms" << std::endl;
    
    // Temporarily stop the node
    bool was_running = running_.load();
    if (was_running) {
        running_ = false;
        
        // Wait for the specified duration
        std::this_thread::sleep_for(std::chrono::milliseconds(duration_ms));
        
        // Restart
        running_ = true;
        supply_voltage_ = simulate_supply_voltage(); // Voltage may change after power cycle
    }
    
    std::cout << "🔋 [" << config_.node_id << "] Power restored" << std::endl;
}

void STM32_SensorNode::change_environment(EnvironmentPattern new_pattern) {
    config_.environment = new_pattern;
    std::cout << "🌡️ [" << config_.node_id << "] Environment changed to: " 
              << get_environment_pattern_string() << std::endl;
}

void STM32_SensorNode::update_base_conditions(float temp, float humidity) {
    current_base_temp_ = temp;
    current_base_humidity_ = humidity;
    std::cout << "📊 [" << config_.node_id << "] Base conditions updated: " 
              << temp << "°C, " << humidity << "%" << std::endl;
}

