Hakob23/thermal-monitoring/hardware-emulation/stm32-sensors/STM32_SensorNode.cpp
//=============================================================================
// Private Methods - Threading
//=============================================================================

void STM32_SensorNode::sensor_reading_loop() {
    std::cout << "🔄 [" << config_.node_id << "] Sensor reading loop started" << std::endl;
    
    while (running_.load()) {
        // Read sensor
        SensorReading reading = read_sensor();
        
        // Store reading
        {
            std::lock_guard<std::mutex> lock(data_mutex_);
            last_reading_ = reading;
            reading_history_.push_back(reading);
            
            // Limit history size
            if (reading_history_.size() > MAX_HISTORY) {
                reading_history_.erase(reading_history_.begin());
            }
        }
        
        reading_count_++;
        
        if (reading.is_valid) {
            std::cout << "📊 [" << config_.node_id << "] T: " 
                      << std::fixed << std::setprecision(1) << reading.temperature_celsius 
                      << "°C, H: " << reading.humidity_percent 
                      << "%, V: " << std::setprecision(2) << reading.supply_voltage << "V"
                      << " (ADC: " << reading.raw_temp_adc << "/" << reading.raw_humidity_adc << ")"
                      << std::endl;
        } else {
            std::cout << "❌ [" << config_.node_id << "] Invalid sensor reading" << std::endl;
        }
        
        // Sleep until next reading
        std::this_thread::sleep_for(std::chrono::milliseconds(config_.reading_interval_ms));
    }
    
    std::cout << "🏁 [" << config_.node_id << "] Sensor reading loop finished" << std::endl;
}

void STM32_SensorNode::transmission_loop() {
    std::cout << "📡 [" << config_.node_id << "] Transmission loop started" << std::endl;
    
    while (running_.load()) {
        // Check if we have data to transmit
        SensorReading reading;
        {
            std::lock_guard<std::mutex> lock(data_mutex_);
            reading = last_reading_;
        }
        
        // Check connection status
        if (check_connection_fault()) {
            std::cout << "📶 [" << config_.node_id << "] Connection fault - transmission skipped" << std::endl;
            std::this_thread::sleep_for(std::chrono::milliseconds(config_.transmission_interval_ms));
            continue;
        }
        
        // Transmit based on communication protocol
        if (reading.is_valid) {
            switch (config_.comm_protocol) {
                case CommProtocol::UART_TO_GATEWAY:
                case CommProtocol::SPI_TO_GATEWAY:
                case CommProtocol::I2C_TO_GATEWAY: {
                    if (uart_callback_) {
                        std::vector<uint8_t> packet = create_binary_packet(reading);
                        uart_callback_(config_.node_id, packet);
                        std::cout << "📤 [" << config_.node_id << "] Data sent via " 
                                  << get_comm_protocol_string() << " (" << packet.size() << " bytes)" << std::endl;
                    }
                    break;
                }
                
                case CommProtocol::MQTT_DIRECT: {
                    if (mqtt_callback_) {
                        std::string message = format_mqtt_message(reading);
                        std::string topic = "sensors/" + config_.node_id + "/data";
                        mqtt_callback_(topic, message);
                        std::cout << "📤 [" << config_.node_id << "] Data sent via MQTT to topic: " 
                                  << topic << std::endl;
                    }
                    break;
                }
            }
            
            transmission_count_++;
        }
        
        // Sleep until next transmission
        std::this_thread::sleep_for(std::chrono::milliseconds(config_.transmission_interval_ms));
    }
    
    std::cout << "🏁 [" << config_.node_id << "] Transmission loop finished" << std::endl;
}

//=============================================================================
// Private Methods - Sensor Simulation
//=============================================================================

SensorReading STM32_SensorNode::read_sensor() {
    SensorReading reading = {};
    reading.timestamp = std::chrono::steady_clock::now();
    reading.supply_voltage = simulate_supply_voltage();
    reading.sensor_status = get_sensor_status();
    
    // Check for sensor faults
    reading.is_valid = !check_sensor_fault();
    
    if (reading.is_valid) {
        // Simulate sensor readings
        reading.temperature_celsius = simulate_temperature();
        reading.humidity_percent = simulate_humidity();
        
        // Convert to ADC values (simulate hardware)
        reading.raw_temp_adc = temperature_to_adc(reading.temperature_celsius);
        reading.raw_humidity_adc = humidity_to_adc(reading.humidity_percent);
        
        // BME280 also has pressure
        if (config_.sensor_type == SensorType::BME280) {
            reading.pressure_hpa = 1013.25f + temp_noise_(random_generator_) * 10.0f;
        }
        
        // Apply sensor drift over time
        sensor_drift_ += config_.drift_rate * (fault_dist_(random_generator_) - 0.5f);
        reading.temperature_celsius += sensor_drift_;
    } else {
        // Invalid reading - set to error values
        reading.temperature_celsius = -999.0f;
        reading.humidity_percent = -999.0f;
        reading.raw_temp_adc = 0xFFFF;
        reading.raw_humidity_adc = 0xFFFF;
    }
    
    return reading;
}

float STM32_SensorNode::simulate_temperature() {
    auto now = std::chrono::steady_clock::now();
    auto elapsed = now - start_time_;
    float hours = std::chrono::duration_cast<std::chrono::milliseconds>(elapsed).count() / 3600000.0f;
    
    // Apply environmental pattern
    float temp = apply_environmental_pattern(current_base_temp_, hours, true);
    
    // Add sensor noise
    temp += temp_noise_(random_generator_);
    
    // Apply sensor-specific characteristics
    switch (config_.sensor_type) {
        case SensorType::DHT22:
            temp = std::round(temp * 10.0f) / 10.0f; // 0.1°C resolution
            break;
        case SensorType::DS18B20:
            temp = std::round(temp * 16.0f) / 16.0f; // 0.0625°C resolution
            break;
        case SensorType::BME280:
            temp = std::round(temp * 100.0f) / 100.0f; // 0.01°C resolution
            break;
        case SensorType::SHT30:
            temp = std::round(temp * 100.0f) / 100.0f; // 0.01°C resolution
            break;
        case SensorType::FAULTY_SENSOR:
            if (fault_dist_(random_generator_) < 0.1f) {
                temp += (fault_dist_(random_generator_) - 0.5f) * 50.0f; // Random spikes
            }
            break;
        default:
            break;
    }
    
    return temp;
}

