Hakob23/thermal-monitoring/hardware-emulation/stm32-sensors/STM32_SensorNode.cpp
float STM32_SensorNode::simulate_humidity() {
    auto now = std::chrono::steady_clock::now();
    auto elapsed = now - start_time_;
    float hours = std::chrono::duration_cast<std::chrono::milliseconds>(elapsed).count() / 3600000.0f;
    
    // Apply environmental pattern
    float humidity = apply_environmental_pattern(current_base_humidity_, hours, false);
    
    // Add sensor noise
    humidity += humidity_noise_(random_generator_);
    
    // Clamp to valid range
    humidity = std::max(0.0f, std::min(100.0f, humidity));
    
    // Apply sensor-specific characteristics
    switch (config_.sensor_type) {
        case SensorType::DHT22:
            humidity = std::round(humidity * 10.0f) / 10.0f; // 0.1% resolution
            break;
        case SensorType::BME280:
            humidity = std::round(humidity * 1024.0f) / 1024.0f; // High resolution
            break;
        case SensorType::SHT30:
            humidity = std::round(humidity * 100.0f) / 100.0f; // 0.01% resolution
            break;
        case SensorType::DS18B20:
            humidity = 0.0f; // No humidity sensor
            break;
        case SensorType::FAULTY_SENSOR:
            if (fault_dist_(random_generator_) < 0.1f) {
                humidity = fault_dist_(random_generator_) * 120.0f; // Invalid readings
            }
            break;
        default:
            break;
    }
    
    return humidity;
}

float STM32_SensorNode::apply_environmental_pattern(float base_value, float time_hours, bool is_temperature) {
    float result = base_value;
    float variation = is_temperature ? config_.temp_variation : config_.humidity_variation;
    
    switch (config_.environment) {
        case EnvironmentPattern::INDOOR_STABLE:
            // Small random variations around base value
            result += std::sin(time_hours * 0.1f) * variation * 0.3f;
            break;
            
        case EnvironmentPattern::OUTDOOR_VARIABLE:
            // Larger variations with daily cycles
            result += std::sin(time_hours * M_PI / 12.0f) * variation; // Daily cycle
            result += std::sin(time_hours * M_PI / 6.0f) * variation * 0.3f; // Weather variation
            break;
            
        case EnvironmentPattern::HEATING_CYCLE:
            if (is_temperature) {
                // Heating cycles every 2 hours
                float cycle = std::fmod(time_hours, 2.0f);
                if (cycle < 1.0f) {
                    result += variation * (1.0f - cycle); // Heating on
                } else {
                    result -= variation * (cycle - 1.0f); // Heating off
                }
            }
            break;
            
        case EnvironmentPattern::COOLING_CYCLE:
            if (is_temperature) {
                // Cooling cycles every 1.5 hours
                float cycle = std::fmod(time_hours, 1.5f);
                if (cycle < 0.75f) {
                    result -= variation * cycle; // Cooling on
                } else {
                    result += variation * (cycle - 0.75f); // Cooling off
                }
            }
            break;
            
        case EnvironmentPattern::INDUSTRIAL:
            // Sharp changes due to machinery
            result += std::sin(time_hours * 2.0f) * variation * 1.5f;
            if (fault_dist_(random_generator_) < 0.05f) {
                result += (fault_dist_(random_generator_) - 0.5f) * variation * 3.0f;
            }
            break;
            
        case EnvironmentPattern::GREENHOUSE:
            // Controlled environment with irrigation cycles
            result += std::sin(time_hours * M_PI / 8.0f) * variation * 0.5f; // 16-hour cycle
            if (!is_temperature) {
                // Humidity spikes during watering
                if (std::fmod(time_hours, 4.0f) < 0.5f) {
                    result += variation * 2.0f;
                }
            }
            break;
            
        case EnvironmentPattern::SERVER_ROOM:
            if (is_temperature) {
                // Stable but slightly elevated
                result += 3.0f + std::sin(time_hours * 0.2f) * 1.0f;
            } else {
                // Low humidity
                result *= 0.6f;
            }
            break;
            
        case EnvironmentPattern::BASEMENT:
            if (is_temperature) {
                result -= 3.0f; // Cooler
            } else {
                result += 15.0f; // More humid
            }
            result += std::sin(time_hours * 0.05f) * variation * 0.2f; // Very slow changes
            break;
            
        case EnvironmentPattern::ATTIC:
            if (is_temperature) {
                result += 5.0f; // Warmer
                result += std::sin(time_hours * M_PI / 12.0f) * variation * 2.0f; // Strong daily cycle
            }
            break;
    }
    
    return result;
}

bool STM32_SensorNode::check_sensor_fault() {
    // Temporary fault injection
    if (sensor_fault_) {
        // Clear fault after some time
        if (fault_dist_(random_generator_) < 0.1f) {
            sensor_fault_ = false;
            std::cout << "🔧 [" << config_.node_id << "] Sensor fault cleared" << std::endl;
        }
        return true;
    }
    
    // Random faults based on configuration
    if (fault_dist_(random_generator_) < config_.fault_probability) {
        std::cout << "⚠️ [" << config_.node_id << "] Random sensor fault occurred" << std::endl;
        return true;
    }
    
    // Intermittent sensor behavior
    if (config_.sensor_type == SensorType::INTERMITTENT) {
        return fault_dist_(random_generator_) < 0.3f; // 30% failure rate
    }
    
    return false;
}

bool STM32_SensorNode::check_connection_fault() {
    // Temporary connection fault
    if (connection_fault_) {
        // Clear fault after some time
        if (fault_dist_(random_generator_) < 0.2f) {
            connection_fault_ = false;
            std::cout << "📶 [" << config_.node_id << "] Connection restored" << std::endl;
        }
        return true;
    }
    
    // Random connection issues
    if (fault_dist_(random_generator_) > config_.connection_stability) {
        connection_fault_ = true;
        std::cout << "📶 [" << config_.node_id << "] Connection fault detected" << std::endl;
        return true;
    }
    
