Hakob23/thermal-monitoring/hardware-emulation/stm32-sensors/STM32_SensorNode.cpp
    return false;
}

//=============================================================================
// Private Methods - Data Formatting
//=============================================================================

std::string STM32_SensorNode::format_uart_message(const SensorReading& reading) {
    std::stringstream ss;
    ss << "STM32:" << config_.node_id << ","
       << "T:" << std::fixed << std::setprecision(2) << reading.temperature_celsius << ","
       << "H:" << reading.humidity_percent << ","
       << "V:" << reading.supply_voltage << ","
       << "S:" << std::hex << static_cast<int>(reading.sensor_status)
       << std::dec << "\n";
    return ss.str();
}

std::string STM32_SensorNode::format_mqtt_message(const SensorReading& reading) {
    std::stringstream ss;
    ss << "{"
       << "\"temperature\":" << reading.temperature_celsius << ","
       << "\"humidity\":" << reading.humidity_percent << ","
       << "\"location\":\"" << config_.location << "\","
       << "\"node_id\":\"" << config_.node_id << "\","
       << "\"supply_voltage\":" << reading.supply_voltage << ","
       << "\"sensor_status\":" << static_cast<int>(reading.sensor_status) << ","
       << "\"timestamp\":" << std::chrono::duration_cast<std::chrono::seconds>(
              reading.timestamp.time_since_epoch()).count()
       << "}";
    return ss.str();
}

std::vector<uint8_t> STM32_SensorNode::create_binary_packet(const SensorReading& reading) {
    std::vector<uint8_t> packet;
    
    // Simple binary protocol:
    // [Header(2)] [NodeID(4)] [Temp(4)] [Humidity(4)] [Voltage(2)] [Status(1)] [Checksum(1)]
    
    // Header
    packet.push_back(0xAA);
    packet.push_back(0xBB);
    
    // Node ID (simplified - use hash)
    uint32_t node_hash = std::hash<std::string>{}(config_.node_id);
    packet.push_back((node_hash >> 24) & 0xFF);
    packet.push_back((node_hash >> 16) & 0xFF);
    packet.push_back((node_hash >> 8) & 0xFF);
    packet.push_back(node_hash & 0xFF);
    
    // Temperature (as int16 * 100)
    int16_t temp_int = static_cast<int16_t>(reading.temperature_celsius * 100);
    packet.push_back((temp_int >> 8) & 0xFF);
    packet.push_back(temp_int & 0xFF);
    
    // Humidity (as uint16 * 100)
    uint16_t hum_int = static_cast<uint16_t>(reading.humidity_percent * 100);
    packet.push_back((hum_int >> 8) & 0xFF);
    packet.push_back(hum_int & 0xFF);
    
    // Supply voltage (as uint16 * 1000)
    uint16_t volt_int = static_cast<uint16_t>(reading.supply_voltage * 1000);
    packet.push_back((volt_int >> 8) & 0xFF);
    packet.push_back(volt_int & 0xFF);
    
    // Status
    packet.push_back(reading.sensor_status);
    
    // Simple checksum
    uint8_t checksum = 0;
    for (size_t i = 2; i < packet.size(); ++i) {
        checksum ^= packet[i];
    }
    packet.push_back(checksum);
    
    return packet;
}

//=============================================================================
// Private Methods - Hardware Simulation
//=============================================================================

uint16_t STM32_SensorNode::temperature_to_adc(float temp_celsius) {
    // Simulate 12-bit ADC conversion
    // Typical range: -40°C to +85°C -> 0 to 4095
    float normalized = (temp_celsius + 40.0f) / 125.0f;
    normalized = std::max(0.0f, std::min(1.0f, normalized));
    return static_cast<uint16_t>(normalized * 4095.0f);
}

uint16_t STM32_SensorNode::humidity_to_adc(float humidity_percent) {
    // Simulate 12-bit ADC conversion
    // Range: 0% to 100% -> 0 to 4095
    float normalized = humidity_percent / 100.0f;
    normalized = std::max(0.0f, std::min(1.0f, normalized));
    return static_cast<uint16_t>(normalized * 4095.0f);
}

float STM32_SensorNode::simulate_supply_voltage() {
    // Simulate supply voltage variation
    float base_voltage = 3.3f;
    float variation = config_.power_variation * (fault_dist_(random_generator_) - 0.5f);
    return base_voltage + variation;
}

uint8_t STM32_SensorNode::get_sensor_status() {
    uint8_t status = 0x00;
    
    if (sensor_fault_) status |= 0x01;          // Sensor fault bit
    if (connection_fault_) status |= 0x02;      // Connection fault bit
    if (supply_voltage_ < 3.0f) status |= 0x04; // Low voltage bit
    if (reading_count_ > 0) status |= 0x80;     // Data ready bit
    
    return status;
}

//=============================================================================
// Private Methods - Utility
//=============================================================================

std::string STM32_SensorNode::get_sensor_type_string() const {
    switch (config_.sensor_type) {
        case SensorType::DHT22: return "DHT22";
        case SensorType::DS18B20: return "DS18B20";
        case SensorType::BME280: return "BME280";
        case SensorType::SHT30: return "SHT30";
        case SensorType::FAULTY_SENSOR: return "FAULTY";
        case SensorType::INTERMITTENT: return "INTERMITTENT";
        default: return "UNKNOWN";
    }
}

std::string STM32_SensorNode::get_comm_protocol_string() const {
    switch (config_.comm_protocol) {
        case CommProtocol::UART_TO_GATEWAY: return "UART";
        case CommProtocol::MQTT_DIRECT: return "MQTT";
        case CommProtocol::SPI_TO_GATEWAY: return "SPI";
        case CommProtocol::I2C_TO_GATEWAY: return "I2C";
        default: return "UNKNOWN";
    }
}

std::string STM32_SensorNode::get_environment_pattern_string() const {
    switch (config_.environment) {
        case EnvironmentPattern::INDOOR_STABLE: return "Indoor Stable";
        case EnvironmentPattern::OUTDOOR_VARIABLE: return "Outdoor Variable";
        case EnvironmentPattern::HEATING_CYCLE: return "Heating Cycle";
        case EnvironmentPattern::COOLING_CYCLE: return "Cooling Cycle";
        case EnvironmentPattern::INDUSTRIAL: return "Industrial";
        case EnvironmentPattern::GREENHOUSE: return "Greenhouse";
        case EnvironmentPattern::SERVER_ROOM: return "Server Room";
        case EnvironmentPattern::BASEMENT: return "Basement";
        case EnvironmentPattern::ATTIC: return "Attic";
        default: return "Unknown";
    }
}

