Hakob23/thermal-monitoring/hardware-emulation/stm32-sensors/STM32_SensorNode.cpp
//=============================================================================
// SensorDeployment Implementation
//=============================================================================

SensorDeployment::~SensorDeployment() {
    stop_all();
}

void SensorDeployment::add_sensor_node(std::unique_ptr<STM32_SensorNode> node) {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    // Set up callbacks if global ones are available
    if (global_uart_callback_) {
        node->set_uart_callback(global_uart_callback_);
    }
    if (global_mqtt_callback_) {
        node->set_mqtt_callback(global_mqtt_callback_);
    }
    
    sensor_nodes_.push_back(std::move(node));
    std::cout << "➕ Added sensor node to deployment (Total: " << sensor_nodes_.size() << ")" << std::endl;
}

void SensorDeployment::remove_sensor_node(const std::string& node_id) {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    auto it = std::remove_if(sensor_nodes_.begin(), sensor_nodes_.end(),
        [&node_id](const std::unique_ptr<STM32_SensorNode>& node) {
            return node->get_node_id() == node_id;
        });
    
    if (it != sensor_nodes_.end()) {
        sensor_nodes_.erase(it, sensor_nodes_.end());
        std::cout << "➖ Removed sensor node " << node_id << " from deployment" << std::endl;
    }
}

bool SensorDeployment::start_all() {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    std::cout << "🚀 Starting sensor deployment (" << sensor_nodes_.size() << " nodes)..." << std::endl;
    
    bool all_started = true;
    for (auto& node : sensor_nodes_) {
        if (!node->initialize() || !node->start()) {
            all_started = false;
        }
    }
    
    if (all_started) {
        std::cout << "✅ All sensor nodes started successfully" << std::endl;
    } else {
        std::cout << "⚠️ Some sensor nodes failed to start" << std::endl;
    }
    
    return all_started;
}

void SensorDeployment::stop_all() {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    std::cout << "🛑 Stopping sensor deployment..." << std::endl;
    
    for (auto& node : sensor_nodes_) {
        node->stop();
    }
    
    std::cout << "✅ All sensor nodes stopped" << std::endl;
}

std::vector<std::string> SensorDeployment::get_node_ids() const {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    std::vector<std::string> ids;
    for (const auto& node : sensor_nodes_) {
        ids.push_back(node->get_node_id());
    }
    return ids;
}

std::string SensorDeployment::get_deployment_status() const {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    std::stringstream ss;
    ss << "Sensor Deployment Status (" << sensor_nodes_.size() << " nodes):\n";
    
    for (const auto& node : sensor_nodes_) {
        ss << "  " << node->get_status() << "\n";
    }
    
    return ss.str();
}

void SensorDeployment::simulate_power_outage(int duration_ms) {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    std::cout << "⚡ Simulating power outage for all nodes (" << duration_ms << "ms)" << std::endl;
    
    for (auto& node : sensor_nodes_) {
        node->simulate_power_loss(duration_ms);
    }
}

void SensorDeployment::change_all_environments(EnvironmentPattern pattern) {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    for (auto& node : sensor_nodes_) {
        node->change_environment(pattern);
    }
}

void SensorDeployment::inject_random_faults(float fault_rate) {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    std::random_device rd;
    std::mt19937 gen(rd());
    std::uniform_real_distribution<float> dist(0.0f, 1.0f);
    
    for (auto& node : sensor_nodes_) {
        if (dist(gen) < fault_rate) {
            node->inject_fault();
        }
    }
}

std::vector<SensorReading> SensorDeployment::collect_all_readings() const {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    std::vector<SensorReading> all_readings;
    for (const auto& node : sensor_nodes_) {
        auto reading = node->get_last_reading();
        all_readings.push_back(reading);
    }
    return all_readings;
}

void SensorDeployment::save_deployment_log(const std::string& filename) const {
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    
    std::ofstream file(filename);
    if (!file.is_open()) {
        std::cerr << "Failed to open file: " << filename << std::endl;
        return;
    }
    
    file << get_deployment_status();
    
    file << "\nDetailed Readings:\n";
    for (const auto& node : sensor_nodes_) {
        auto readings = node->get_reading_history(10);
        file << "\n" << node->get_node_id() << " (Last 10 readings):\n";
        for (const auto& reading : readings) {
            if (reading.is_valid) {
                file << "  T: " << reading.temperature_celsius 
                     << "°C, H: " << reading.humidity_percent << "%\n";
            }
        }
    }
    
    std::cout << "📄 Deployment log saved to: " << filename << std::endl;
}

void SensorDeployment::set_global_uart_callback(std::function<void(const std::string&, const std::vector<uint8_t>&)> callback) {
    global_uart_callback_ = callback;
    
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    for (auto& node : sensor_nodes_) {
        node->set_uart_callback(callback);
    }
}

void SensorDeployment::set_global_mqtt_callback(std::function<void(const std::string&, const std::string&)> callback) {
    global_mqtt_callback_ = callback;
    
    std::lock_guard<std::mutex> lock(nodes_mutex_);
    for (auto& node : sensor_nodes_) {
        node->set_mqtt_callback(callback);
    }
}

//=============================================================================
// Factory Functions
//=============================================================================

namespace sensor_factory {

SensorNodeConfig create_indoor_node(const std::string& id, const std::string& location) {
    SensorNodeConfig config;
    config.node_id = id;
    config.location = location;
    config.sensor_type = SensorType::DHT22;
    config.comm_protocol = CommProtocol::UART_TO_GATEWAY;
    config.environment = EnvironmentPattern::INDOOR_STABLE;
    config.base_temperature = 22.0f;
    config.base_humidity = 45.0f;
    config.temp_variation = 1.0f;
    config.humidity_variation = 3.0f;
    config.reading_interval_ms = 2000;
    config.transmission_interval_ms = 5000;
    return config;
}

