Hakob23/thermal-monitoring/hardware-emulation/stm32-sensors/STM32_SensorNode.cpp
SensorNodeConfig create_outdoor_node(const std::string& id, const std::string& location) {
    SensorNodeConfig config;
    config.node_id = id;
    config.location = location;
    config.sensor_type = SensorType::BME280;
    config.comm_protocol = CommProtocol::MQTT_DIRECT;
    config.environment = EnvironmentPattern::OUTDOOR_VARIABLE;
    config.base_temperature = 18.0f;
    config.base_humidity = 60.0f;
    config.temp_variation = 5.0f;
    config.humidity_variation = 15.0f;
    config.reading_interval_ms = 3000;
    config.transmission_interval_ms = 10000;
    return config;
}

SensorNodeConfig create_industrial_node(const std::string& id, const std::string& location) {
    SensorNodeConfig config;
    config.node_id = id;
    config.location = location;
    config.sensor_type = SensorType::SHT30;
    config.comm_protocol = CommProtocol::SPI_TO_GATEWAY;
    config.environment = EnvironmentPattern::INDUSTRIAL;
    config.base_temperature = 25.0f;
    config.base_humidity = 40.0f;
    config.temp_variation = 8.0f;
    config.humidity_variation = 10.0f;
    config.fault_probability = 0.005f; // Higher fault rate
    config.reading_interval_ms = 1000;
    config.transmission_interval_ms = 3000;
    return config;
}

SensorNodeConfig create_greenhouse_node(const std::string& id, const std::string& location) {
    SensorNodeConfig config;
    config.node_id = id;
    config.location = location;
    config.sensor_type = SensorType::SHT30;
    config.comm_protocol = CommProtocol::UART_TO_GATEWAY;
    config.environment = EnvironmentPattern::GREENHOUSE;
    config.base_temperature = 26.0f;
    config.base_humidity = 70.0f;
    config.temp_variation = 3.0f;
    config.humidity_variation = 20.0f;
    config.reading_interval_ms = 1500;
    config.transmission_interval_ms = 4000;
    return config;
}

SensorNodeConfig create_server_room_node(const std::string& id, const std::string& location) {
    SensorNodeConfig config;
    config.node_id = id;
    config.location = location;
    config.sensor_type = SensorType::BME280;
    config.comm_protocol = CommProtocol::I2C_TO_GATEWAY;
    config.environment = EnvironmentPattern::SERVER_ROOM;
    config.base_temperature = 24.0f;
    config.base_humidity = 35.0f;
    config.temp_variation = 1.5f;
    config.humidity_variation = 5.0f;
    config.reading_interval_ms = 1000;
    config.transmission_interval_ms = 2000;
    return config;
}

std::unique_ptr<SensorDeployment> create_home_deployment() {
    auto deployment = std::make_unique<SensorDeployment>();
    
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_indoor_node("home_living", "Living Room")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_indoor_node("home_kitchen", "Kitchen")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_indoor_node("home_bedroom", "Master Bedroom")));
    
    // Add basement and attic with special configurations
    auto basement_config = create_indoor_node("home_basement", "Basement");
    basement_config.environment = EnvironmentPattern::BASEMENT;
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(basement_config));
    
    auto attic_config = create_indoor_node("home_attic", "Attic");
    attic_config.environment = EnvironmentPattern::ATTIC;
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(attic_config));
    
    return deployment;
}

std::unique_ptr<SensorDeployment> create_office_deployment() {
    auto deployment = std::make_unique<SensorDeployment>();
    
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_indoor_node("office_lobby", "Main Lobby")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_indoor_node("office_conf1", "Conference Room 1")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_indoor_node("office_conf2", "Conference Room 2")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_server_room_node("office_server", "Server Room")));
    
    return deployment;
}

std::unique_ptr<SensorDeployment> create_industrial_deployment() {
    auto deployment = std::make_unique<SensorDeployment>();
    
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_industrial_node("factory_floor1", "Production Floor 1")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_industrial_node("factory_floor2", "Production Floor 2")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_industrial_node("factory_storage", "Storage Area")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_industrial_node("factory_office", "Factory Office")));
    
    return deployment;
}

std::unique_ptr<SensorDeployment> create_agricultural_deployment() {
    auto deployment = std::make_unique<SensorDeployment>();
    
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_greenhouse_node("greenhouse_1", "Greenhouse Section 1")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_greenhouse_node("greenhouse_2", "Greenhouse Section 2")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_outdoor_node("field_north", "North Field")));
    deployment->add_sensor_node(std::make_unique<STM32_SensorNode>(create_outdoor_node("field_south", "South Field")));
    
    return deployment;
}

} // namespace sensor_factory

} // namespace stm32_simulation 